app/views/items/_form.html.erb

                  <div class="col s12 input-field">
                    <%= form.collection_select :place_id, Place.all, :id, :name ,:place_id => 1 %>
---
SELECT "places".* FROM "places"

                  <div class="col s12 input-field">
                    <%= form.collection_select :genre_id, Genre.all, :id, :name ,:genre_id => 1 %>
---
SELECT "genres".* FROM "genres"

                  <div class="col s12 input-field">
                    <%= form.collection_select :department_id, Department.all, :id, :name ,:department_id => 1 %>
---
SELECT "departments".* FROM "departments"