app/views/items/index.html.erb

        <div class="scroll-horizontal-wrapper">
<% @genres = Genre.all %>
---
SELECT "genres".* FROM "genres"

          <form method="get" class="scroll-horizontal">
<% @places = Place.all %>
---
SELECT "places".* FROM "places"

                    <select name="department_select">
<% @departments = Department.all %>
---
SELECT "departments".* FROM "departments"

<% elsif params["genre_select"].to_i > 0 && params["0yen"] == "1" %>
  <% @items = @items.where({ genre_id: params["genre"], price: 0 }) %>
---
SELECT  "genres".* FROM "genres" WHERE "genres"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]