app/views/items/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."item_id" = ?  [["item_id", 1]]
---

  <% comments = Comment.where(item_id: @item.id) %>