app/controllers/comments_controller.rb

INSERT INTO "comments" ("comment_body", "created_at", "updated_at") VALUES (?, ?, ?)  [["comment_body", "欲しいです"], ["created_at", "2017-11-08 04:59:25.271954"], ["updated_at", "2017-11-08 04:59:25.271954"]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def create
    @comment = Comment.new(comment_params)

    respond_to do |format|
      if @comment.save
        format.html { redirect_to Item.find(comment_params[:item_id]), notice: 'Item was successfully created.' }