app/controllers/items_controller.rb

  def show
    @item = Item.find(params[:id])
    @comments = @item.comments.all
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("name", "image", "price", "detail", "student_id", "created_at", "updated_at", "department_id", "place_id", "genre_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)